USE mdsp;

INSERT INTO User (name, age, idcard, password, phone, email) VALUES
  ('赵华', 17, '312330199512223913', '313536', '13999087837', 'xiaozhao@163.com'),
  ('张斯睿', 55, '610234196512223913', 'zsrxx123456', '18812342871', 'zsr1965@gmail.com'),
  ('宗博文', 28, '312330198512223913', '123456zbw', '13999087830', 'zbw@qq.com');

INSERT INTO Assay (userId, event, patient, sample, gender, department, age
  , demander, coroner, checker, note, startedDate, finishedDate) VALUES
  (1, '孕检', '赵华', '血清', 0, '妇二科', 17, '张健雨', '姚磊', '吕宗凯'
    , '无怀孕迹象', date('2015-12-23'), date('2016-12-24')),
  (1, '血常规', '赵华', '血清', 0, '门诊', 18, '张晨', '姚磊', '吕宗凯'
    , '', date('2016-11-08'), date('2016-11-08')),
  (3, '血常规', '宗博文', '血清', 1, '内科', 28, '檀学文', '姚磊', '吕宗凯'
    , '个别指标偏低', date('2013-03-02'), date('2013-03-02'));

INSERT INTO AssayItem (assayId, name, code, result, hint, reference, unit) VALUES
  (1, '雌二醇', 'E2', '237.30', '↑', '卵泡期:(12.5~166) 排卵期:(85.8~498)', 'pg/ml'),
  (1, '孕酮', 'Prog', '21.82', '↑', '卵泡期:(0,2~1.5) 排卵期:(0.8~3.0)', 'ng/ml'),
  (1, '人绒毛膜促性腺激素β', 'β-HCG', '1770.00', '↑', '≤2', 'mIU/ml'),
  (2, '血蛋白/球蛋白', 'A/G', '1.75', '', '1.20-3.40', ''),
  (2, '天门冬氨酸转移酶', 'AST', '20.0', '', '13.0-40.0', 'U/L'),
  (2, '丙氨酸氨基转移酶', 'ALT', '14.6', '', '7.0-40.0', 'U/L'),
  (2, '天门冬/丙氨酸', 'ST/LT', '1.4', '↑', '0.0-1.0', ''),
  (2, '碱性磷酸酶', 'ALP', '70.0', '', '50-135', 'U/L'),
  (3, '血蛋白/球蛋白', 'A/G', '2.75', '', '1.20-3.40', ''),
  (3, '天门冬氨酸转移酶', 'AST', '10.0', '↓', '13.0-40.0', 'U/L'),
  (3, '丙氨酸氨基转移酶', 'ALT', '12.6', '', '7.0-40.0', 'U/L'),
  (3, '天门冬/丙氨酸', 'ST/LT', '1.3', '↑', '0.0-1.0', ''),
  (3, '碱性磷酸酶', 'ALP', '65.0', '', '50-135', 'U/L');

INSERT INTO Recipe (userId, name, createdDate, gender, age, address, diagnosis, doctor, charge, checker) VALUES
  (1, '赵华', date('2015-12-23'), 0, 17, '山东省莱芜市', '急性肠胃炎', '张健雨', 365.4, '杨明远'),
  (1, '赵华', date('2016-11-08'), 0, 18, '莱芜', '急性肠胃炎,服用康泰', '张晨', 278.0, '蔡玮'),
  (2, '张斯睿', date('2015-06-17'), 1, 55, '宁波北仑', '季节性感冒', '孟奇', 56.8, '何长久'),
  (3, '宗博文', date('2013-03-02'), 1, 28, '淄博市', '体寒', '檀学文', 1180.3, '陈光明');

INSERT INTO DrugItem (recipeId, dosageUnit, dosageQuantity, timePerDay, note) VALUES
  (1, '剂', 1, 1, '每日一剂,水煎400ml,清晨空腹温服'),
  (1, '片', 4, 3, '每次四片,每天三次,饭后口服'),
  (1, '片', 2, 3, '空腹口服'),
  (2, '片', 3, 3, '每次三片,其余按说明书'),
  (2, '片', 2, 2, '多睡觉,注意休息,避免吹风'),
  (3, '袋', 1, 3, '一次一袋,一日三次'),
  (3, '喷', 1, 2, '每天两次,喷于鼻腔中'),
  (4, '剂', 60, 3, '每日三剂,20日见效'),
  (4, '粒', 8, 3, '温水送服'),
  (4, '贴', 1, 1, '每晚睡前帖于肚脐处,起床时拿掉');

INSERT INTO SingleDrugItem (drugItemId, name, purchaseUnit, purchaseQuantity) VALUES
  (1, '藿香', '克', 30),
  (1, '甘草', '克', 15),
  (1, '藏红花', '克', 25),
  (1, '小苏打片', '盒', 2),
  (1, '肠炎宁', '盒', 1),
  (2, '小苏打片', '盒', 3),
  (2, '肠炎宁', '盒', 2),
  (3, '清热解毒颗粒', '盒', 2),
  (3, '喷嚏停喷剂', '瓶', 1),
  (4, '枸杞', '克', 105),
  (4, '当归', '克', 75),
  (4, '山药', '克', 80),
  (4, '灵芝', '克', 15),
  (4, '橘干', '克', 65),
  (4, '养气丸', '盒', 10),
  (4, '补气养血贴膏', '盒', 8);